Catalogs/ПодключаемоеОборудование.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Catalog>
		<Properties>
			<Name>ПодключаемоеОборудование</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>УстройствоИспользуется</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТипПодключения</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ТипыПодключенияОборудования</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТипОборудования</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.ТипыПодключаемогоОборудования</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДрайверОборудования</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ДрайверыОборудования</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.ОрганизацияБПО</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Параметры</Name>
					<Type>
						<v8:Type>v8:ValueStorage</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>РабочееМесто</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.РабочиеМеста</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СерийныйНомер</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>128</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СпособФорматноЛогическогоКонтроля</Name>
					<Type>
						<v8:Type>cfg:EnumRef.СпособыФорматноЛогическогоКонтроля</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДопустимоеРасхождениеФорматноЛогическогоКонтроля</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТребуетсяПереустановка</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТребуетсяУстановка</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>АвтоматическаяФискализация</Name>
					<Comment>Автоматическая фискализация чеков из очереди чеков</Comment>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИспользуетсяФН36</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>УдалитьВыводитьОтраслевыеРеквизиты</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>ОграничениеДоступа</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Пользователь</Name>
							<Type>
								<v8:TypeSet>cfg:DefinedType.ПользовательБПО</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>ПараметрыРегистрации</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>НаименованиеПараметра</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>50</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ЗначениеПараметра</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>100</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

CommonModules/МенеджерОборудованияБПКлиент/Ext/Module.bsl
#Область ОбновлениеДрайверов

Процедура ОткрытьФормуОбновлениеДрайверов() Экспорт
	ОткрытьФорму("Справочник.ПодключаемоеОборудование.Форма.ПредложитьОбновитьДрайвера",,,,,,,РежимОткрытияОкнаФормы.БлокироватьВесьИнтерфейс);
КонецПроцедуры

Процедура ПриОткрытииСменыНаККТ(ИдентификаторУстройстваККТ, ПараметрыРегистрации) Экспорт
	ПараметрыФормы = Новый Структура;
	ПараметрыФормы.Вставить("ИдентификаторУстройстваККТ", ИдентификаторУстройстваККТ);
	ПараметрыФормы.Вставить("ПараметрыРегистрации",       ПараметрыРегистрации);
	
	ОписаниеОповещения = Новый ОписаниеОповещения("ПроверкаДрайверовЗавершение", ЭтотОбъект, ПараметрыФормы);
	Если МенеджерОборудованияБПВызовСервера.ТребуетсяОбновлениеДрайвера(ИдентификаторУстройстваККТ) Тогда
		ОткрытьФорму("Справочник.ПодключаемоеОборудование.Форма.ПредложитьОбновитьДрайвера",
			Новый Структура("ИдентификаторОборудования", ИдентификаторУстройстваККТ),,,,,
			ОписаниеОповещения,РежимОткрытияОкнаФормы.БлокироватьВесьИнтерфейс);
			
	ИначеЕсли ОписаниеОповещения <> Неопределено Тогда
		ВыполнитьОбработкуОповещения(ОписаниеОповещения);	
		
	КонецЕсли;
КонецПроцедуры

Процедура ПроверкаДрайверовЗавершение(Значение, ПараметрыФормы) Экспорт
	ОткрытьФорму("Справочник.ПодключаемоеОборудование.Форма.ПроверкаСНОДляККТ", 
		ПараметрыФормы, 
		, , , , , РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
КонецПроцедуры

#КонецОбласти

#Область РаботаСЭкземлпяромОборудования

Процедура ЭкземплярОборудованияПередЗаписью(Объект, ЭтаФорма, Отказ, ПараметрыЗаписи) Экспорт
	ПараметрыЗаписи.Вставить("Организация", Объект.Организация);
	Если ОбщегоНазначенияКлиентСервер.ЕстьРеквизитИлиСвойствоОбъекта(ЭтаФорма, "Склад") Тогда
		ПараметрыЗаписи.Вставить("Склад", ЭтаФорма.Склад);
	КонецЕсли;
	
	Если Объект.ТипОборудования = ПредопределенноеЗначение("Перечисление.ТипыПодключаемогоОборудования.ККТ") 
		ИЛИ Объект.ТипОборудования = ПредопределенноеЗначение("Перечисление.ТипыПодключаемогоОборудования.ОблачнаяККТ") Тогда
		
		ПараметрыЗаписи.Вставить("Отправляет1СSMS",           ЭтаФорма.Отправляет1СSMS = 1);
		ПараметрыЗаписи.Вставить("Отправляет1СEmail",         ЭтаФорма.Отправляет1СEmail = 1);
		ПараметрыЗаписи.Вставить("ЗаполнятьКонтактныеДанные", ЭтаФорма.ЗаполнятьКонтактныеДанные);
		ПараметрыЗаписи.Вставить("ПечататьЧек",               ЭтаФорма.ПечататьЧек);
		ПараметрыЗаписи.Вставить("РасчетыВИнтернет",          ЭтаФорма.РасчетыВИнтернет);
		ПараметрыЗаписи.Вставить("АдресСайта",                ЭтаФорма.АдресСайта);
		
		ПараметрыЗаписи.Вставить("ОтправлятьEMail", ЭтаФорма.ОтправлятьEMail);
		ПараметрыЗаписи.Вставить("ОтправлятьSMS", ЭтаФорма.ОтправлятьSMS);
		
		ПараметрыЗаписи.Вставить("ИспользоватьДляСБП", ЭтаФорма.ИспользоватьДляСБП);
	ИначеЕсли Объект.ТипОборудования = ПредопределенноеЗначение("Перечисление.ТипыПодключаемогоОборудования.ЭквайринговыйТерминал") Тогда
		ПараметрыПодключенияНСПК = Новый Структура("АдресСервисаНСПК, КлючОрганизацииНСПК, ИдентификаторНСПК, КлючКассыНСПК, ПроверятьКорневыеСертификаты, ПротоколОбменаФЭСНСПК");
		ЗаполнитьЗначенияСвойств(ПараметрыПодключенияНСПК, ЭтаФорма);
		
		ПараметрыЗаписи.Вставить("ПараметрыПодключенияНСПК", ПараметрыПодключенияНСПК);
		
		ПараметрыЗаписи.Вставить("ЭлектронныеСертификатыНСПК", ЗначениеЗаполнено(ПараметрыПодключенияНСПК.КлючКассыНСПК))
	КонецЕсли; 
КонецПроцедуры

Процедура ЭкземплярОборудованияПослеЗаписи(Объект, ЭтаФорма, ПараметрыЗаписи) Экспорт
	Если ПараметрыЗаписи.Свойство("НужноОбновитьИнтерфейс") Тогда
		ОбновитьИнтерфейс();
	КонецЕсли;
	ГруппаПараметрыРегистрацииККТ = ЭтаФорма.Элементы.Найти("ГруппаПараметрыРегистрацииККТ");
	Если ГруппаПараметрыРегистрацииККТ <> Неопределено Тогда
		ГруппаПараметрыРегистрацииККТ.Видимость = ЗначениеЗаполнено(Объект.Ссылка) И (Объект.ТипОборудования = ПредопределенноеЗначение("Перечисление.ТипыПодключаемогоОборудования.ККТ"));
	КонецЕсли; 
КонецПроцедуры

Процедура ЭкземплярОборудованияОбработкаНавигационнойСсылки(Объект, ЭтаФорма, НавигационнаяСсылкаФорматированнойСтроки, СтандартнаяОбработка) Экспорт
	СтандартнаяОбработка = Ложь;
	Если НавигационнаяСсылкаФорматированнойСтроки = "НастроитьSMS" Тогда
		ОткрытьФорму("ОбщаяФорма.НастройкаОтправкиSMS",,,,,,,РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
	ИначеЕсли НавигационнаяСсылкаФорматированнойСтроки = "НастроитьEmail" Тогда 
		ОписаниеОповещения = Новый ОписаниеОповещения("ОтправитьПоЭлектроннойПочтеНастройкаУчетнойЗаписиПредложена", ЭтотОбъект, Новый Структура("Форма", ЭтаФорма));
		РаботаСПочтовымиСообщениямиКлиент.ПроверитьНаличиеУчетнойЗаписиДляОтправкиПочты(ОписаниеОповещения);
	Иначе
		СтандартнаяОбработка = Истина;
	КонецЕсли; 
КонецПроцедуры

Процедура ЭкземплярОборудованияТипОборудованияВыбор(Объект, ЭтаФорма, ЭтотОбъект, Элемент, ВыбранноеЗначение) Экспорт
	
	ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(ЭтаФорма.Элементы, "Склад", "ПодсказкаВвода",                  НСтр("ru='Если оборудование используется в розничном магазине'"));
	ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(ЭтаФорма.Элементы, "Склад", "АвтоОтметкаНезаполненного",       Ложь);
	ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(ЭтаФорма.Элементы, "Склад", "ОтметкаНезаполненного",           Ложь);
	
	ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(ЭтаФорма.Элементы, "ГруппаНастройкиККТ", "Видимость", 
		Объект.ТипОборудования = ПредопределенноеЗначение("Перечисление.ТипыПодключаемогоОборудования.ККТ") 
		ИЛИ Объект.ТипОборудования = ПредопределенноеЗначение("Перечисление.ТипыПодключаемогоОборудования.ОблачнаяККТ"));
		
	ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(ЭтаФорма.Элементы, "ГруппаПечататьЧек", "Видимость", 
		Объект.ТипОборудования = ПредопределенноеЗначение("Перечисление.ТипыПодключаемогоОборудования.ККТ"));
		
	ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(ЭтаФорма.Элементы, "ГруппаЭлектронныеСертификатыНСПК", "Видимость", 
		Объект.ТипОборудования = ПредопределенноеЗначение("Перечисление.ТипыПодключаемогоОборудования.ЭквайринговыйТерминал"));
		
	Если НЕ МенеджерОборудованияБПВызовСервера.ОборудованиеТребуетОрганизацию(ВыбранноеЗначение) Тогда
		Объект.Организация = ПредопределенноеЗначение("Справочник.Организации.ПустаяСсылка");
		
		ЭтаФорма.ОрганизацияВидимость = Ложь;
		ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(ЭтаФорма.Элементы, "Организация", "АвтоОтметкаНезаполненного", Ложь);
		Возврат;
	КонецЕсли;
	
	Если НЕ ЗначениеЗаполнено(Объект.Организация) Тогда
		Объект.Организация = ОбщегоНазначенияБПВызовСервера.ОсновнаяОрганизация();
	КонецЕсли;
	
	ЭтаФорма.ОрганизацияВидимость = ЭтаФорма.ИспользуетсяНесколькоОрганизаций;
	ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(ЭтаФорма.Элементы, "Организация", "АвтоОтметкаНезаполненного", ЭтаФорма.ИспользуетсяНесколькоОрганизаций);
КонецПроцедуры

Процедура ЭкземплярОборудованияПриИзмененииЭлементаФормы(Объект, ЭтотОбъект, Элемент) Экспорт
	Если Элемент.Имя = "РасчетыВИнтернет" Тогда
		ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(ЭтотОбъект.Элементы, "АдресСайта", "Доступность", ЭтотОбъект.РасчетыВИнтернет);
	КонецЕсли;
КонецПроцедуры

#КонецОбласти

#Область РаботаСФормойФискальнойЗаписи

Процедура ФормаЗаписиФискальныеОперацииОбработкаНавигационнойСсылки(Запись, ЭтаФорма, НавигационнаяСсылкаФорматированнойСтроки, СтандартнаяОбработка) Экспорт
	Если НавигационнаяСсылкаФорматированнойСтроки = "ДокументОснование" Тогда
		
		ИмяФормыДокумента = МенеджерОборудованияБПВызовСервера.ИмяФормыДокумента(Запись.ДокументОснование);
		
		ПараметрыФормы = Новый Структура("ПоказатьБаннерЧекКоррекции, Ключ", Истина, Запись.ДокументОснование);
		ОткрытьФорму(ИмяФормыДокумента, ПараметрыФормы, ЭтаФорма);
		СтандартнаяОбработка = Ложь;
	КонецЕсли;
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Процедура ОтправитьПоЭлектроннойПочтеНастройкаУчетнойЗаписиПредложена(УчетнаяЗаписьНастроена, ДополнительныеПараметры) Экспорт
	Если УчетнаяЗаписьНастроена <> Истина Тогда
		Возврат;
	КонецЕсли;
	
	ОткрытьФорму(
		"Справочник.УчетныеЗаписиЭлектроннойПочты.ФормаОбъекта",
		Новый Структура("Ключ", МенеджерОборудованияБПВызовСервера.СистемнаяУчетнаяЗапись()),
		ДополнительныеПараметры.Форма,,,,,РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
		
КонецПроцедуры
	
#КонецОбласти
